app/controllers/admin/costcs_controller.rb

SELECT `costcs`.* FROM `costcs`
---
  def index
    @costcs = Costc.all

INSERT INTO `costcs` (`code`, `name`, `description`, `created_at`, `updated_at`) VALUES ('213123', 'sdasdasd', 'asdasdasd', '2016-08-31 21:06:00', '2016-08-31 21:06:00')
INSERT INTO `labor_costcs` (`labor_id`, `costc_id`, `created_at`, `updated_at`) VALUES (1, 3, '2016-09-01 02:48:30', '2016-09-01 02:48:30')
---
  def create
    @costc = Costc.new(costc_params)
    if @costc.save

      params[:costc][:labors2].each do |labor|
        if labor.present?
          nuevo = LaborCostc.new
          nuevo[:labor_id] = labor
          nuevo[:costc_id] = @costc.id
          nuevo.save

INSERT INTO `labor_costcs` (`labor_id`, `costc_id`, `created_at`, `updated_at`) VALUES (3, 4, '2016-09-05 19:48:57', '2016-09-05 19:48:57')
---
  def update
    respond_to do |format|
      if @costc.update(costc_params)
              params[:costc][:labors2].each do |labor|
        if labor.present?
          nuevo = LaborCostc.new
          nuevo[:labor_id] = labor
          nuevo[:costc_id] = @costc.id
          nuevo.save

DELETE FROM `costcs` WHERE `costcs`.`id` = 2
---
  def destroy
    @costc.destroy

SELECT  `costcs`.* FROM `costcs` WHERE `costcs`.`id` = 5 LIMIT 1
---
    def set_costc
      @costc = Costc.find(params[:id])