app/controllers/admin/labors_controller.rb

SELECT `labors`.* FROM `labors`
---
  def index
    @labors = Labor.all

INSERT INTO `labors` (`code`, `name`, `paymentunit`, `rate`, `created_at`, `updated_at`) VALUES ('906', 'Día obrero agrícola', 'jornal', 29439.0, '2016-08-31 20:56:23', '2016-08-31 20:56:23')
---
  def create
    @labor = Labor.new(labor_params)
    if @labor.save

UPDATE `labors` SET `paymentunit` = 'jornal', `updated_at` = '2016-09-05 20:02:11' WHERE `labors`.`id` = 3
---
  def update
    respond_to do |format|
      if @labor.update(labor_params)

DELETE FROM `labors` WHERE `labors`.`id` = 1
---
  def destroy
    @labor.destroy

SELECT  `labors`.* FROM `labors` WHERE `labors`.`id` = 1 LIMIT 1
---
    def set_labor
      @labor = Labor.find(params[:id])