app/controllers/admin/operators_controller.rb

  def index
    @operators = Operator.all
---
SELECT `operators`.* FROM `operators`

  def create
    @operator = Operator.new(operator_params)

    @operator[:state] = "Activo"
    log(@operator)
    if @operator.save
---
INSERT INTO `operators` (`cc`, `name`, `job_id`, `lastname`, `dateadmission`, `created_at`, `updated_at`) VALUES ('', '', 1, '', '2016-09-08 21:21:00', '2016-09-08 21:21:13', '2016-09-08 21:21:13')

  def update

    if @operator.jobs.present?
      @operator = Operator.find(params[:id])
      @operator.jobs.delete_all
    end

    params[:operator][:jobs2].each do |job|
      if job.present?
        jobforoperator = JobOperator.new
        jobforoperator[:job_id] = job
        jobforoperator[:operator_id] = @operator.id
        jobforoperator.save
      end
    end

    respond_to do |format|
      if @operator.update(operator_params)
---
SELECT  `operators`.* FROM `operators` WHERE `operators`.`id` = 1 LIMIT 1
UPDATE `operators` SET `name` = 'sdasd', `state` = 'Activo', `job_id` = 3, `lastname` = 'sadasdasdasd', `dateadmission` = '2016-09-07 01:03:00', `updated_at` = '2016-09-07 01:03:55' WHERE `operators`.`id` = 2

  def retired
    @operator = Operator.find(params[:id])
    @operator[:state] = "Retirado"

    if @operator.save
---
SELECT  `operators`.* FROM `operators` WHERE `operators`.`id` = 6 LIMIT 1
UPDATE `operators` SET `state` = 'Retirado', `updated_at` = '2016-09-07 16:55:54' WHERE `operators`.`id` = 6

  def reinstated
    @operator = Operator.find(params[:id])
    @operator[:state] = "Reintegrado"

    if @operator.save
---
SELECT  `operators`.* FROM `operators` WHERE `operators`.`id` = 6 LIMIT 1
UPDATE `operators` SET `state` = 'Reintegrado', `updated_at` = '2016-09-07 16:55:56' WHERE `operators`.`id` = 6

  def destroy
    @operator.destroy
---
DELETE FROM `operators` WHERE `operators`.`id` = 7

    def set_operator
      @operator = Operator.find(params[:id])
---
SELECT  `operators`.* FROM `operators` WHERE `operators`.`id` = 7 LIMIT 1