app/controllers/admin/sublots_controller.rb

  def index
    @sublots = Sublot.all
---
SELECT `sublots`.* FROM `sublots`

  def create
    @sublot = Sublot.new(sublot_params)
      if @sublot.save
---
INSERT INTO `sublots` (`name`, `description`, `code`, `created_at`, `updated_at`) VALUES ('qdasdas', 'dasdasdasdas', '1312312', '2016-09-07 14:42:20', '2016-09-07 14:42:20')

  def update
    respond_to do |format|
      if @sublot.update(sublot_params)
---
UPDATE `sublots` SET `description` = 'aaaaaaaaaaaa', `updated_at` = '2016-09-07 14:15:05' WHERE `sublots`.`id` = 4

  def destroy
    @sublot.destroy
---
DELETE FROM `sublots` WHERE `sublots`.`id` = 4

    def set_sublot
      @sublot = Sublot.find(params[:id])
---
SELECT  `sublots`.* FROM `sublots` WHERE `sublots`.`id` = 4 LIMIT 1