app/controllers/admin/supervisors_controller.rb

SELECT `supervisors`.* FROM `supervisors`
---
  def index
    @supervisors = Supervisor.all

INSERT INTO `supervisors` (`name`, `lastname`, `cc`, `state`, `position`, `dateadmission`, `created_at`, `updated_at`) VALUES ('ASASAS', 'ASASAS', 123123123.0, 'Activo', '1', '2016-09-02 16:36:00', '2016-09-02 16:36:29', '2016-09-02 16:36:29')
---
  def create
    @supervisor = Supervisor.new(supervisor_params)
    @supervisor[:state] = "Activo"

    if @supervisor.save

SELECT  `supervisors`.* FROM `supervisors` WHERE `supervisors`.`id` = 3 LIMIT 1
UPDATE `supervisors` SET `lastname` = '11111121112', `updated_at` = '2016-09-02 17:26:24' WHERE `supervisors`.`id` = 1
---
  def update
    if @supervisor.operators.present?
      @supervisor = Supervisor.find(params[:id])
      @supervisor.operators.delete_all
    end

    params[:supervisor][:operators2].each do |operator|
      if operator.present?
        nuevo = OperatorSupervisor.new
        nuevo[:operator_id] = operator
        nuevo[:supervisor_id] = @supervisor.id
        nuevo.save
      end
    end

    if @supervisor.jobs.present?
      @supervisorJob = Supervisor.find(params[:id])
      @supervisorJob.jobs.delete_all
    end

    params[:supervisor][:jobs2].each do |job|
      if job.present?
        jobforsupervisor = JobSupervisor.new
        jobforsupervisor[:job_id] = job
        jobforsupervisor[:supervisor_id] = @supervisor.id
        jobforsupervisor.save
      end
    end

    respond_to do |format|
      if @supervisor.update(supervisor_params)

DELETE FROM `supervisors` WHERE `supervisors`.`id` = 3
---
  def destroy
    @supervisor.destroy

SELECT  `supervisors`.* FROM `supervisors` WHERE `supervisors`.`id` = 3 LIMIT 1
---
    def set_supervisor
      @supervisor = Supervisor.find(params[:id])