app/views/admin/costcs/edit.html.erb

SELECT `labors`.* FROM `labors` INNER JOIN `labor_costcs` ON `labors`.`id` = `labor_costcs`.`labor_id` WHERE `labor_costcs`.`costc_id` = 1
---
    <%= f.label :labors2 , "Labores"%><br>
    <%= f.select :labors2 , Labor.all.map { |j|  [ j.code + " " + j.name , j.id ]  } , {selected: @costc.labors.map { |e| e.id }}, {:multiple => true, class:"form-control"} %>