app/views/admin/costcs/index.html.erb

SELECT `labors`.* FROM `labors` INNER JOIN `labor_costcs` ON `labors`.`id` = `labor_costcs`.`labor_id` WHERE `labor_costcs`.`costc_id` = 1
---
        <td><%= costc.sublots.map { |e| e.name }.join("<br>").html_safe %></td>
        <td><%= costc.labors.map { |e| e.name }.join("<br>").html_safe %></td>