app/views/admin/costcs/new.html.erb

SELECT `labors`.* FROM `labors`
---
    <%= f.label :labors2 , "Labores"%><br>
    <%= f.select :labors2 , Labor.all.map { |j|  [ j.code + " " + j.name , j.id ]  } , {}, {:multiple => true, class:"form-control"} %>