app/controllers/costcs_controller.rb

SELECT `costcs`.* FROM `costcs`
---
  def index
    @costcs = Costc.all

INSERT INTO `costcs` (`code`, `name`, `description`, `created_at`, `updated_at`) VALUES ('', '', '', '2016-08-31 20:07:31', '2016-08-31 20:07:31')
---
  def create
    @costc = Costc.new(costc_params)
    if @costc.save

DELETE FROM `costcs` WHERE `costcs`.`id` = 1
---
  def destroy
    @costc.destroy

SELECT  `costcs`.* FROM `costcs` WHERE `costcs`.`id` = 5 LIMIT 1
---
    def set_costc
      @costc = Costc.find(params[:id])