app/controllers/labors_controller.rb

SELECT `labors`.* FROM `labors`
---
  def index
    @labors = Labor.all

UPDATE `labors` SET `paymentunit` = 'Jornal', `updated_at` = '2016-09-02 16:18:27' WHERE `labors`.`id` = 3
---
  def update
    respond_to do |format|
      if @labor.update(labor_params)

SELECT  `labors`.* FROM `labors` WHERE `labors`.`id` = 3 LIMIT 1
---
    def set_labor
      @labor = Labor.find(params[:id])