app/controllers/operators_controller.rb

  def index
    @operators = Operator.all
---
SELECT `operators`.* FROM `operators`

  def create
    @operator = Operator.new(operator_params)
      if @operator.save
---
INSERT INTO `operators` (`cc`, `name`, `position`, `state`, `created_at`, `updated_at`) VALUES ('', '', '', 'Activo', '2016-08-29 22:26:52', '2016-08-29 22:26:52')

  def update
    respond_to do |format|
      if @operator.update(operator_params)
---
UPDATE `operators` SET `state` = 'Activo', `job_id` = 3, `dateadmission` = '2016-09-01 01:50:00', `updated_at` = '2016-09-01 01:50:18' WHERE `operators`.`id` = 4

  def destroy
    @operator.destroy
---
DELETE FROM `operators` WHERE `operators`.`id` = 4

    def set_operator
      @operator = Operator.find(params[:id])
---
SELECT  `operators`.* FROM `operators` WHERE `operators`.`id` = 4 LIMIT 1