app/controllers/sublots_controller.rb

  def index
    @sublots = Sublot.all
---
SELECT `sublots`.* FROM `sublots`

  def create
    @sublot = Sublot.new(sublot_params)

    respond_to do |format|
      if @sublot.save
---
INSERT INTO `sublots` (`code`, `name`, `description`, `created_at`, `updated_at`) VALUES ('3312231', 'sadasdasdasdasdadasd', '', '2016-09-07 13:51:23', '2016-09-07 13:51:23')

  def update
    respond_to do |format|
      if @sublot.update(sublot_params)
---
UPDATE `sublots` SET `description` = 'q', `updated_at` = '2016-09-07 14:14:00' WHERE `sublots`.`id` = 1

  def destroy
    @sublot.destroy
---
DELETE FROM `sublots` WHERE `sublots`.`id` = 3

    def set_sublot
      @sublot = Sublot.find(params[:id])
---
SELECT  `sublots`.* FROM `sublots` WHERE `sublots`.`id` = 3 LIMIT 1