app/controllers/supervisors_controller.rb

SELECT `supervisors`.* FROM `supervisors`
---
  def index
    @supervisors = Supervisor.all

INSERT INTO `supervisors` (`name`, `lastname`, `state`, `position`, `dateadmission`, `created_at`, `updated_at`) VALUES ('', '', '', '', '2016-08-31 15:11:00', '2016-08-31 15:11:34', '2016-08-31 15:11:34')
---
  def create
    @supervisor = Supervisor.new(supervisor_params)
    if @supervisor.save

UPDATE `supervisors` SET `lastname` = '111111', `updated_at` = '2016-09-02 17:20:17' WHERE `supervisors`.`id` = 1
---
  def update
    respond_to do |format|
      if @supervisor.update(supervisor_params)

DELETE FROM `supervisors` WHERE `supervisors`.`id` = 1
---
  def destroy
    @supervisor.destroy

SELECT  `supervisors`.* FROM `supervisors` WHERE `supervisors`.`id` = 2 LIMIT 1
---
    def set_supervisor
      @supervisor = Supervisor.find(params[:id])